<a href="https://colab.research.google.com/github/klnsuman/MachineLearning/blob/master/Hackathon.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import os
os.chdir('/content/drive/My Drive/Anamoly')

In [ ]:
!ls -lrt

total 122684
-rw------- 1 root root    274780 Nov 20 04:51 faccount.txt
-rw------- 1 root root 125352890 Nov 20 04:52 ftxn2.txt
-rw------- 1 root root       366 Nov 20 04:53 fagraph.ddl

In [ ]:
df_facct = pd.read_csv('faccount.txt')
df_facct

      ACCTID  ACCTTYPE  ... ADDRESS_LON     CATEGORY
0     800039  BUSINESS  ...  153.073105  Supermarket
1     800040  BUSINESS  ...  153.073470      Grocery
2     800041    CREDIT  ...  153.097588  Supermarket
3     800042  BUSINESS  ...  153.056983  Supermarket
4     800043    CREDIT  ...  152.955089      Grocery
...      ...       ...  ...         ...          ...
1995  501232  BUSINESS  ...  153.084632     CUSTOMER
1996  501233    CREDIT  ...  152.984622     CUSTOMER
1997  501234   SAVINGS  ...  153.094632     CUSTOMER
1998  501235    CREDIT  ...  152.985188     CUSTOMER
1999  501236   SAVINGS  ...  153.024467     CUSTOMER

[2000 rows x 12 columns]

In [ ]:
df_ftxn = pd.read_csv('ftxn2.txt')
df_ftxn

               TXN_ID    TXTYPE  ...  ISFRAUD  ISFLAGGED
0        950060711303   PAYMENT  ...        N          Y
1        950060711401   PAYMENT  ...        N          Y
2        950060711402  TRANSFER  ...        N          Y
3        950060711403   PAYMENT  ...        N          Y
4        950060711501   PAYMENT  ...        N          Y
...               ...       ...  ...      ...        ...
1533061  950134025802  TRANSFER  ...        N          Y
1533062  950134025803   PAYMENT  ...        N          Y
1533063  950134025901   PAYMENT  ...        N          Y
1533064  950134025902  TRANSFER  ...        N          Y
1533065  950134025903   PAYMENT  ...        N          Y

[1533066 rows x 9 columns]

In [ ]:
df_ftxn['ISFLAGGED'].unique()

array(['Y'], dtype=object)

In [ ]:
df_ftxn["AMOUNT"]

0           320
1            48
2          6209
3            66
4            47
           ...
1533061    9159
1533062     323
1533063      75
1533064    3997
1533065     211
Name: AMOUNT, Length: 1533066, dtype: int64

In [ ]:
df_ftxn

               TXN_ID    TXTYPE  ...  ISFRAUD  ISFLAGGED
0        950060711303   PAYMENT  ...        N          Y
1        950060711401   PAYMENT  ...        N          Y
2        950060711402  TRANSFER  ...        N          Y
3        950060711403   PAYMENT  ...        N          Y
4        950060711501   PAYMENT  ...        N          Y
...               ...       ...  ...      ...        ...
1533061  950134025802  TRANSFER  ...        N          Y
1533062  950134025803   PAYMENT  ...        N          Y
1533063  950134025901   PAYMENT  ...        N          Y
1533064  950134025902  TRANSFER  ...        N          Y
1533065  950134025903   PAYMENT  ...        N          Y

[1533066 rows x 9 columns]

In [ ]:
df_ftxn["AMOUNT"].sum(),df_ftxn["AMOUNT"].min(),df_ftxn["AMOUNT"].max()

(2859883724, 25, 200020)

In [ ]:
df_ftxn["AMOUNT"].describe().round()

count    1533066.0
mean        1865.0
std         3039.0
min           25.0
25%           66.0
50%          280.0
75%         2873.0
max       200020.0
Name: AMOUNT, dtype: float64

In [ ]:
import numpy as np
import tensorflow as tf
import pandas as pd
pd.options.mode.chained_assignment = None
import seaborn as sns
from matplotlib.pylab import rcParams
import matplotlib.pyplot as plt
import plotly.express as px
import plotly.graph_objects as go

%matplotlib inline

sns.set(style='whitegrid', palette='muted')
rcParams['figure.figsize'] = 14, 8
np.random.seed(1)
tf.random.set_seed(1)

print('Tensorflow version:', tf.__version__)

Tensorflow version: 2.3.0

In [ ]:
df_ftxn["AMOUNT"].describe()

count    1.533066e+06
mean     1.865467e+03
std      3.039119e+03
min      2.500000e+01
25%      6.600000e+01
50%      2.800000e+02
75%      2.873000e+03
max      2.000200e+05
Name: AMOUNT, dtype: float64

In [21]:
df_ftxn.describe().round()

             TXN_ID     AMOUNT  FROMACCTID   TOACCTID
count  1.533066e+06  1533066.0   1533066.0  1533066.0
mean   9.504230e+11     1865.0    500710.0   700368.0
std    5.380156e+10     3039.0      1792.0   141185.0
min    9.500000e+11       25.0    500000.0   500000.0
25%    9.500350e+11       66.0    500350.0   501049.0
50%    9.500700e+11      280.0    500700.0   800149.0
75%    9.501050e+11     2873.0    501050.0   800224.0
max    9.150080e+12   200020.0    800435.0   800435.0